app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["body", "testt"], ["created_at", "2020-03-19 08:46:42.406409"], ["updated_at", "2020-03-19 08:46:42.406409"]]
---
    def create
        list = List.new(list_params)
        list.save

SELECT "lists".* FROM "lists"
---
    def index
        @lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @list = List.find(params[:id])

INSERT INTO "lists" ("title", "body", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?, ?)  [["title", "画像が投稿できます"], ["body", "実際に投稿しましょう"], ["created_at", "2020-03-20 18:49:43.171446"], ["updated_at", "2020-03-20 18:49:43.171446"], ["image_id", nil]]
---
    def create
        list = List.new(list_params)
        list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @list = List.find(params[:id])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "投稿すると"], ["body", "詳細ページに移動します"], ["updated_at", "2020-03-19 15:27:40.010297"], ["id", 1]]
---
    def update
        list = List.find(params[:id])
        list.update(list_params)